Repository: Hima1710/esteana
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Istiana
ar: استعانة

# startJourney
source: Start My Journey
ar: ابدأ رحلتي

# welcomeToJourney
source: Welcome to your Journey
ar: مرحباً بك في رحلتك

# loginGoogle
source: Login with Google
ar: الدخول بجوجل

# continueGuest
source: Continue as Guest
ar: المتابعة كضيف

source: Skip
ar: تخطي

# guestSyncMessage
source: Sign in to save your progress forever.
ar: سجّل الدخول لحفظ إنجازتك للأبد.

# loginRequired
source: Sign in to request prayer.
ar: سجّل الدخول لطلب الدعاء.

source: Time remaining
ar: يتبقى

# dhikrComingSoon
source: Dhikr section coming soon.
ar: قسم الأذكار قريباً.

# qiblaComingSoon
source: Qibla finder coming soon.
ar: محدد القبلة قريباً.

source: Share
ar: مشاركة

source: Cancel
ar: إلغاء

source: Submit
ar: إرسال

source: Next Prayer
ar: الصلاة القادمة

source: Quick Access
ar: وصول سريع

source: Prayer Times
ar: مواعيد الصلاة

source: Prayer Times – Month
ar: مواعيد الشهر

source: Full month
ar: الشهر بالكامل

# dateHijri
source: Hijri
ar: هجري

# dateGregorian
source: Gregorian
ar: ميلادي

source: Quran
ar: مصحف

source: Mushaf Index
ar: فهرس المصحف

# mushafLoading
source: Loading Mushaf…
ar: جاري تحميل المصحف…

# mushafViewImages
source: View page images
ar: عرض صور الصفحات

# mushafViewText
source: View text
ar: عرض النص

# tabSurahs
source: Surahs
ar: السور

# tabJuzs
source: Juzs
ar: الأجزاء

# tabLastRead
source: Last Read
ar: آخر تصفح

# tabBookmarks
source: Bookmarks
ar: العلامات

source: No results
ar: لا توجد نتائج

source: Continue reading
ar: متابعة القراءة

# noBookmarks
source: No bookmarks yet
ar: لا توجد علامات بعد

# noLastRead
source: No reading progress yet
ar: لا يوجد تقدم قراءة بعد

source: Makki
ar: مكي

source: Madani
ar: مدني

# versesCount
source: {count} verses
ar: {count} آية

# juz
source: Juz {number}
ar: الجزء {number}

source: Search surah or verse…
ar: بحث سورة أو آية…

# pageOf
source: Page {current} of {total}
ar: صفحة {current} من {total}

# adhkar
source: Dhikr
ar: أذكار

# dhikrCategoryMorning
source: Morning Adhkar
ar: أذكار الصباح

# dhikrCategoryEvening
source: Evening Adhkar
ar: أذكار المساء

# dhikrCategoryAfterPrayer
source: Adhkar After Prayer
ar: أذكار بعد الصلاة

# dhikrCategorySleep
source: Bedtime Adhkar
ar: أذكار النوم

# dhikrCategoryTawba
source: Repentance & Istighfar
ar: التوبة والاستغفار

# dhikrDescMorning
source: Adhkar said from dawn until noon
ar: أذكار تقال من طلوع الفجر إلى الزوال

# dhikrDescEvening
source: Adhkar said from afternoon until midnight
ar: أذكار تقال من العصر إلى منتصف الليل

# dhikrDescAfterPrayer
source: Adhkar after each prayer
ar: أذكار عقب كل صلاة

# dhikrDescSleep
source: Adhkar before sleep
ar: أذكار قبل النوم

# dhikrDescTawba
source: A hundred istighfar daily for comfort and forgiveness
ar: مئة استغفار يومياً تُكسبك الونس والمغفرة

# tawbaCompletionMessage
source: Well done! A hundred istighfar today. O Allah, forgive us and accept our repentance.
ar: أحسنت! مئة استغفار اليوم. اللهم اغفر لنا وتب علينا.

source: Qibla
ar: قبلة

source: Qibla Direction
ar: اتجاه القبلة

# pleaseCalibrate
source: Please calibrate your device by moving it in a figure-8 pattern.
ar: يرجى معايرة الجهاز بحركة شكل 8.

# locationDenied
source: Location access was denied. Enable it in settings to find Qibla.
ar: تم رفض الموقع. فعّله من الإعدادات لإيجاد القبلة.

# locationRequired
source: Location is required to calculate Qibla direction.
ar: الموقع مطلوب لحساب اتجاه القبلة.

# qiblaAligned
source: You are facing the Qibla
ar: أنت متجه نحو القبلة

# sensorsError
source: Compass unavailable. Please check device sensors.
ar: البوصلة غير متوفرة. تحقق من حساسات الجهاز.

# actionTitle
source: I am a Muslim by my Actions
ar: أنا مسلم بأفعالي

# actionOfDay
source: Action of the Day
ar: تحدي اليوم

# todayChallenge
source: Read a page from a beneficial book and apply one thing you read.
ar: اقرأ صفحة من كتاب نافع وطبّق أمراً واحداً مما قرأت.

source: My Daily Tasks
ar: مهامي اليومية

# noTasksToday
source: No tasks for today. Add from the list.
ar: لا توجد مهام اليوم. أضف من القائمة.

source: Done
ar: تم

# dailyTaskDailyPrayers
source: Daily Prayers
ar: الصلوات الخمس

# dailyTaskSmile
source: Smile
ar: الابتسامة

# dailyTaskGratitude
source: Gratitude and Praise
ar: الامتنان والحمد

source: Luminous Pieces
ar: القطع النورانية

# progressMsg
source: In a week, you've done {count} good deeds
ar: في أسبوع، قمت بـ {count} فعل خير

source: Pray for me
ar: ادعُ لي

# prayForMeHint
source: A space to request prayer from your brothers and sisters. Share your need or pray for those who shared.
ar: مساحة لطلب الدعاء من إخوتك. شارك حاجتك أو ادعُ لمن شارك.

source: Request prayer
ar: اطلب الدعاء

# iPrayed
source: I prayed for you
ar: دعوت لك

source: Group Challenges
ar: تحديات جماعية

# joinReading
source: Join a reading group this week
ar: قراءة جماعية هذا الأسبوع

# joinReadingHint
source: Join a group and read together
ar: انضم لمجموعة واقرأ معاً

source: Dhikr Challenge
ar: تحدي الأذكار

# dhikrChallengeHint
source: Complete morning and evening adhkar with others
ar: أكمل أذكار الصباح والمساء مع الآخرين

source: Daily Wisdom
ar: مقولة اليوم

source: Short Clips
ar: مقاطع قصيرة

# mihrab
source: Al-Mihrab
ar: المحراب

source: Athari
ar: أثري

# majlis
source: Al-Majlis
ar: المجلس

source: Zad
ar: زاد

source: History
ar: التاريخ

source: Master Treasury
ar: الصندوق الجامع

source: Today's Dhikr
ar: أذكار اليوم

source: Settings
ar: الإعدادات

source: Language
ar: اللغة

# theme
source: Appearance
ar: المظهر

# themeSystem
source: System
ar: حسب الجهاز

# themeLight
source: Light
ar: فاتح

# themeDark
source: Dark
ar: داكن

source: About
ar: حول التطبيق

source: Version
ar: الإصدار
